Documents/ПолученопоПоТалонам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПолученопоПоТалонам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПолученоПредметЛьгот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕденицаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕденицыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Талоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛьготнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕденицаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕденицыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТалона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаТалона</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СельскийСовет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаОполучении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаявителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПредметЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаявителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПредметЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаявителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Талоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВедомости</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПолученопоПоТалонам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроходРасходПриИзменении(Элемент)
	Если Объект.ПроходРасход = Истина Тогда
		Элементы.ПроходРасход.Заголовок = "Приход";
	Иначе
		Элементы.ПроходРасход.Заголовок = "Расход";
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	МинДата = Неопределено;
	МаксДата = Неопределено;
	
	МассивДанных = Новый Массив();
	
	Для Каждого Строка Из Объект.Расход Цикл 
		 //Определение max и min даты
		Дата = Строка.ДатаСобытия;
		Если МинДата = Неопределено ИЛИ МинДата > Дата Тогда
			МинДата = Дата;
		КонецЕсли;
		Если МаксДата = Неопределено ИЛИ МаксДата < Дата Тогда
			МаксДата = Дата;
		КонецЕсли;
		// поместить номер талона в массив
		МассивДанных.Добавить(Строка.НомерТалона);
	КонецЦикла;	
	Объект.ПериодНачало = МинДата ;
	Объект.ПериодОкончание = МаксДата;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.Номер 				КАК НомерТалона,
		|	ТалоныТалоныТЧ.ДатаВыдачи 			КАК ДатаТалона,
		|	ТалоныТалоныТЧ.Заявитель 			КАК Заявитель,
		|	ТалоныТалоныТЧ.Категория 			КАК ЛьготнаяКатегория,
		|	ТалоныТалоныТЧ.ПредметЛьготы 		КАК ПредметЛьготы,
		|	ТалоныТалоныТЧ.ЕденицыИзмерения 	КАК ЕденицаИзмерения,
		|	ТалоныТалоныТЧ.НормаОтпуска 		КАК Количество,
		|	ТалоныТалоныТЧ.СельскийСовет 		КАК СельскийСовет,
		|	ТалоныТалоныТЧ.ДокументОснование 	КАК ДокументОснование,
		|	ТалоныТалоныТЧ.НомерСтроки 			КАК НомерРеестра,
		|	ТалоныТалоныТЧ.Ссылка.Ссылка 		КАК Ведомость
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ТалоныТалоныТЧ.Номер В(&НомераТалонов)
		|	И ТалоныТалоныТЧ.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Дата1", Объект.ВидЛьготы.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Объект.ВидЛьготы.ДатаОкончания);
	Запрос.УстановитьПараметр("НомераТалонов", МассивДанных);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для Каждого Строка Из Объект.Расход Цикл 
			НомерТалона = Выборка.НомерТалона;
			Если  Строка.НомерТалона = НомерТалона Тогда
				Строка.ДатаТалона 				= Выборка.ДатаТалона;
				Строка.Заявитель 				= Выборка.Заявитель;
				Строка.ЛьготнаяКатегория        = Выборка.ЛьготнаяКатегория;
				Строка.ПредметЛьготы            = Выборка.ПредметЛьготы;
				Строка.ЕденицаИзмерения         = Выборка.ЕденицаИзмерения;
				Строка.Количество               = Выборка.Количество;
				Строка.НомерРеестра             = Выборка.НомерРеестра;
				Строка.СельскийСовет            = Выборка.СельскийСовет;
				Строка. ДокументОснование       = Выборка.ДокументОснование;
				Строка.Ведомость				= Выборка.Ведомость;
				Строка.ОтметкаОполучении        = "Выдано";
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьИнформациюНаСервере1()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученопоПоТалонамРасход.ЛьготнаяКатегория 	КАК ЛьготнаяКатегория,
		|	ПолученопоПоТалонамРасход.ПредметЛьготы 		КАК ПредметЛьготы,
		|	СУММА(1) 										КАК КоличествоЗаявителей,
		|	СУММА(ПолученопоПоТалонамРасход.Количество) 	КАК КоличествоПредметЛьготы
		|ИЗ
		|	Документ.ПолученопоПоТалонам.Расход КАК ПолученопоПоТалонамРасход
		|ГДЕ
		|	ПолученопоПоТалонамРасход.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПолученопоПоТалонамРасход.ЛьготнаяКатегория,
		|	ПолученопоПоТалонамРасход.ПредметЛьготы";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = Объект.Информация1.Добавить();
		НС.Категория = Выборка.ЛьготнаяКатегория;
		НС.ПредметЛьготы = Выборка.ПредметЛьготы;
		НС.КоличествоЗаявителей  = Выборка.КоличествоЗаявителей;
		НС.КоличествоПредметЛьготы    =  Выборка.КоличествоПредметЛьготы;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
&НаСервере
Процедура СформироватьИнформациюНаСервере2()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученопоПоТалонамРасход.ПредметЛьготы 	КАК ПредметЛьготы,
		|	СУММА(1) 									КАК КоличествоЗаявителей,
		|	СУММА(ПолученопоПоТалонамРасход.Количество) КАК Количество
		|ИЗ
		|	Документ.ПолученопоПоТалонам.Расход 		КАК ПолученопоПоТалонамРасход
		|ГДЕ
		|	ПолученопоПоТалонамРасход.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПолученопоПоТалонамРасход.ПредметЛьготы";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = Объект.Информация2.Добавить();
		НС.ПредметЛьготы   = Выборка.ПредметЛьготы;
		НС.КоличествоЗаявителей = Выборка.КоличествоЗаявителей;
		НС.КоличествоПредметЛьготы  = Выборка.Количество;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
&НаСервере
Процедура СформироватьИнформациюНаСервере3()
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученопоПоТалонамРасход.ПредметЛьготы КАК ПредметЛьготы,
		|	СУММА(1) КАК КоличествоЗаявителей,
		|	ПолученопоПоТалонамРасход.Ведомость.НомерВедомости КАК НомерВедомости,
		|	ПолученопоПоТалонамРасход.Ведомость КАК Ведомость,
		|	ПолученопоПоТалонамРасход.ЛьготнаяКатегория КАК Категория
		|ИЗ
		|	Документ.ПолученопоПоТалонам.Расход КАК ПолученопоПоТалонамРасход
		|ГДЕ
		|	ПолученопоПоТалонамРасход.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПолученопоПоТалонамРасход.ПредметЛьготы,
		|	ПолученопоПоТалонамРасход.Ведомость,
		|	ПолученопоПоТалонамРасход.ЛьготнаяКатегория
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ведомость";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = Объект.Информация3.Добавить();
		НС.ПредметЛьготы  =  Выборка.ПредметЛьготы;
		НС.КоличествоЗаявителей = Выборка.КоличествоЗаявителей;
		НС.Ведомость = Выборка.Ведомость;
		НС.Категория = Выборка.Категория;
		НС.НомерВедомости = Выборка.НомерВедомости;
	КонецЦикла;
	

КонецПроцедуры	
&НаКлиенте
Процедура СформироватьИнформацию(Команда)
	Объект.Информация1.Очистить();
	Объект.Информация2.Очистить();
	Объект.Информация3.Очистить();
	СформироватьИнформациюНаСервере1();
	СформироватьИнформациюНаСервере2();
	СформироватьИнформациюНаСервере3();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуВЛичномДеле(Команда)
	УстановитьОтметкуВЛичномДелеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуВЛичномДелеНаСервере()
	Для Каждого Строка Из  Объект.Расход Цикл
		  ДокЛичноеДело = Строка.ДокументОснование.ПолучитьОбъект();
		  ДокЛичноеДело.ВыдачаПоТалонуПроведена = Истина;
		  ДокЛичноеДело.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура РасходКоличествоПриИзменении(Элемент)
	ТД = Элементы.Расход.ТекущиеДанные;
	Если ТД.Количество = 0 Тогда
		 ТД.ОтметкаОполучении = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	МассивДанных = Новый Массив();
	Для Каждого Строка Из Объект.Расход Цикл 
		МассивДанных.Добавить(Строка.НомерТалона);
	КонецЦикла;	

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученопоПоТалонамРасход.НомерТалона 			КАК НомерТалона,
		|	ПолученопоПоТалонамРасход.ДатаТалона 			КАК ДатаТалона,
		|	ПолученопоПоТалонамРасход.Ссылка.Номер 			КАК Номер,
		|	ПолученопоПоТалонамРасход.Ссылка.Дата 			КАК Дата,
		|	ПолученопоПоТалонамРасход.Заявитель 			КАК Заявитель
		|ИЗ
		|	Документ.ПолученопоПоТалонам.Расход КАК ПолученопоПоТалонамРасход
		|ГДЕ
		|	ПолученопоПоТалонамРасход.НомерТалона В(&НомераТалонов)
		|	И ПолученопоПоТалонамРасход.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ПолученопоПоТалонамРасход.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Дата1", Объект.ВидЛьготы.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Объект.Дата - 60*60*24);
	Запрос.УстановитьПараметр("НомераТалонов", МассивДанных);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для Каждого Строка Из Объект.Расход Цикл 
			Если  Строка.НомерТалона = Выборка.НомерТалона Тогда
				Строка.ОтметкаОполучении  =  "Талон внесен в док №"+Выборка.Номер+" от "+Строка(Выборка.Дата);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



КонецПроцедуры

&НаСервере
Процедура ОтметитьДатуВыдачиВВедомостьНаСервере()
	Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ПолученопоПоТалонамРасход.Ведомость КАК Ведомость,
|	ПолученопоПоТалонамРасход.ДатаСобытия КАК ДатаСобытия,
|	ПолученопоПоТалонамРасход.Заявитель КАК Заявитель
|ИЗ
|	Документ.ПолученопоПоТалонам.Расход КАК ПолученопоПоТалонамРасход
|ГДЕ
|	ПолученопоПоТалонамРасход.Ссылка = &Ссылка
|	И ПолученопоПоТалонамРасход.Ведомость <> ЗНАЧЕНИЕ(Документ.Талоны.ПустаяСсылка)";
Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Пока Выборка.Следующий() Цикл
	Док = Выборка.Ведомость.ПолучитьОбъект();
	Если Док.Проведен Тогда
		Для Каждого Строка Из Док.ТалоныТЧ Цикл
			Если Строка.ДатаОтпускаУгля  = Дата('00010101')Тогда
				Строка.ДатаОтпускаУгля = Выборка.ДатаСобытия;		
			КонецЕсли;	
		КонецЦикла;
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;		
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьДатуВыдачиВВедомость(Команда)
	ОтметитьДатуВыдачиВВедомостьНаСервере();
КонецПроцедуры
